# Chapter 1 — Patron route.
# Entry point from the prologue: vubor_patron

label vubor_patron:

    $ menu_avoids_center_portrait = True

    "Думаю, варто вибрати собаку, обожнюю фуррі тяночок."

    "Як говорив великий класик: всєгда готов."

    scene bg desktop

    show patron

    "Сайт закрився і на робочому столі зʼявилася людина з мордою та ногами собаки. Вона була породи Майкл Джексон, нє, Джордж Расел, нє, джек рассел."

    "Бля, звідки я знаю стільки порід псів? Походу тому що мене математичка весь рік сукою їбучою називала."

    "Та псина чимось нагадувала мені Курта Кобейна, але в неї не було штанів та одягнені довгі панчохи." 

    "Цікаво, що може з цього вийти. Що б їй сказати…"

    "Тарасик не придумав нічого краще, ніж звичайне привітання, як з ним кожен ранок віталася мама. "

    "Тато теж… та і всі…"

    t "Привіт. Ти хто? Як тебе звати? Шо ти таке блять?"

    p "Привіт, StrawLeg1991! Моє імʼя — Пес Патрон Веронікович. "

    "Почувши чоловічий голос, хлопець здивувався не менше, ніж від освідчення Вовчика в цей проклятий день."

    "Навіть зараз його гетеросексуальна дупа опинилася в загрозі! Але він надто настроївся на спілкування, щоб відступати."

    "Зібравши всі свої моральні сили, Тарас продовжив діалог."

    t "Чому в тебе не по батькові, а по матері?"

    p "В мене немає батька, тільки мама була, і то померла до мого народження."

    t "Оу, шкода."

    p "Угу, сказала, що не хоче щоб цей уїбан був її сином і сіганула в вікно з криками “Аллах Акбар”, десь там впала на клумбу і підірвалась. Ніхто досі не знає звідки вона взяла ті міни."

    "Тарас був в ахує від такого, але він встиг згадати про своїх батьків, які поїхали на острів якогось фізика, здається його Енштейн звати, і так і не написали з вчора звідти, але Тарасу було так само все одно на них. "

    "Тарас давно не читав паблік Хуйова Одеса та міг прогавити, що в Китаї почалась війна. "

    "А згадуючи, що його батько любив замовляти на Тему труси, страпони і гайки та приймав всі умови використання не читаючи користувацькі погодження, хоча хто їх блять читає?"

    "Не буде дивом якщо в якомусь з пунктів писалося про те, що при початку війни він зобовʼязаний стати на бік Китаю та воювати за партію під Малою Токмачкою"

    "Мама певно поїхала в якості снаряда. Тато дуже любив грати в Ангрі Бєрдз, але в нього буде замість пташечки порося з яблучком в сраці"

    "Але це при тих умовах, що мама встигне поїсти, бо хоча вона дуже любила пожерти, вона, якщо пропускала сніданок, або другий прийом їжі, то одразу скидала свої соковиті жири і ставала така худа, ніби її 3 місяці не годували"

    "Хлопець подумав, що йому не завадило б змінити нік на щось біль хайпове, щось тіпа Potuzhny67, а не соломʼяна ніжка, і відповів тій помилці природнього відбору."

    t "Я – Тарас Федькович Кулісракович, я вчуся в 10 класі, люблю робити сальто і сцяти у всіх можливих позах. "

    p "Тарас... *Сказав Патрон собі під його волохатий ніс, немов смакуючи.*"

    p "*Після цього, він пристрасно прижав Тарасика до стіни та сказав, облизуючи свої вуста і свій мокрий псячий ніс*"

    p "Тарасик…"

    t "Що? Йоб твою маму. Ну я так і думав що без скурвого сина не обійдеться."

    t "Я навіть почав розвиватися, такими темпами я буду вже вулиці підмітати, а не працювати в дрочільні давалкою, як мій тато казав."

    t "Треба похуярить в роблокс 48 годин підряд щоб скорегувати втрати."

    "Ох, памʼятаю, як грали з Вовчиком. Спочатку в роблокс потім в доту а потім з пісю… піском. "

    "Кінетичним піском рожевого кольору. "

    "Батько якось переплутав їх ліпаки з хомʼяком з Неньютонівською рідиною під шубою"

    "Він зʼїв ту няшечку-вкусняшечку-смачнулечку та потім лежав в інфекційному відділенні."

    "Виявилося, проблема була не в пісочку, а в хомʼяках, в Кулісрака старшого була жахлива алергія на їхню шерсть"

    "Він потім ледве одужав, а після того навіть захотів поїхати до Польщі на клубніки за 3 злотих на годину"

    "Йому прислали повідомлення в Вайбері, навіть купили білет, але то були якісь аферисти свідки Єгора, які його вислідили та вирізали яєчка та Сфінктер Одді."

    "Не знаю, нащо це вам, але мама після цієї відпустки зробила сім абортів і це тільки за останні пів року. Тарас ще памʼятав, як тоді до неї кожну середу приходили якісь чорні чоловіки, скоріш за все це були студенти медичного з Нігерії."

    p "Я взагалі-то тут… Ти маєш навчитися… *Я так чекав, щоб Тарасик-кун-семпай пупсікоз мене відшмагав смачненько, як останню сучку*."

    t "Блять, ну окей, їбаш якусь хуйню."

    "В Тараса не було планів на вечір. Марінка його динамить, а Вовчик… ну ви самі в курсі."

    "Він був в ахуї та не очікував, що сексуальний Патрон насправді буде з ним роліть."

    p "*Патрон, бачачи, як у Тараса пофарбувалося обличчя червоним кольором від збентеження, усміхнувся, взяв того за підборіддя та прошепотів*."

    p "Хах, Тарасик, тебе так легко засмутити."

    "Тарас, не розуміючи що це таке коїться, вирішив сказати одну з найлогічніших фраз."

    t "Песик, я все розумію, але припини будь ласка, мені не приємно"

    p "*Зрозумів, що він веде себе занадто наполегливо, різко відпрянув від Тараса, немов ошпаривши свої волохаті лапи та прибрав руку зі стіні позаду Тараса і промовив, ледь не плачучи.*"

    p "Пробач, солоденький. Я не хотів тебе лякати."

    p "*Він відійшов на крок назад, щоб точно не давити на Тараса. *"

    p "Добре, вибач ще раз. Я більше так не буду. Давай натомість дізнаємося один одного краще." 

    p "Давай розкажемо по одному факту про себе."

    "Патрончик почухав свою сідницю та понюхав руку ." 

    p "Я буду першим. Я дуже люблю робити різні фрукти в шоколаді." 

    p "*Пошепки* Особливо бананчики." 

    menu:
        "Уточнити?"

        "Уточнити":
            jump specify


        "Не уточнювати":
            jump quastions_to_patron


    return




label specify:

    $ choice_specify = True

    p "Який шоколад? Я просто запихаю в дупу фрукт спочатку, легенько облизую, а потім їм. Особливо смачно виходить, коли у мене понос."

    "Лице Тараса зїбаторилося та ком підійшов до горла, так йому захотілось наригати на клавіатуру, щоб його комп’ютер взірвався до пізди з тим псом."

    "Ліберали були в ахуї…"

    "А мізогінічки плакали…"

    p "*Патрончик витягнув незроміло звідки полунички на шпажці, яка вже була в “шоколаді”.*"

    p "Тарасику, закрий очі та відкрий будь ласка ротик."

    menu:
        "Зробити чи відмовитися?"

        "Зробити":
            jump eat_strawberry



        "Відмовитися":
            t "Ні, дякую, я навіть думати не хочу про таке думати."

            "Патрон засмутився. Він зʼїв цю неймовірну вкусняшку сам та почав."

            jump quastions_to_patron


    return




label eat_strawberry:

    $ choice_eat_strawberry = True

    "Тарас подумав, що це всеодно в компʼютері, тому йому нема чого втрачати." 

    p "Так, мій солоденький, дякую~~~ Молодець, все зʼїв? Тобі сподобалося?"

    menu:
        "Так, мій солоденький, дякую~~~ Молодець, все зʼїв? Тобі сподобалося?"


        "Так":
            $ choice_yes = True

            t "Так, Патрон, мені дуже сподобалося."

            "Насправді їбало Тараса було так зкукуруджено, що останнє, що можна було зчитати з того лиця, це задоволення."

            p "Дякую, пупсику~"

            jump quastions_to_patron


        "Ні":
            t "Ні! Це якась залупела смердюча, мені щось подібне бабуся готувала з дорблю малинового варення, шкварок та яйця, і все це було зі смаком цибулі і носків які вона носила 67 років підряд." 

            p "БАТЯ, ІДИ СЮДИ, БУДЕМО ТРУСІКИ МІРЯТИ. "

            p "Давай пісяти на шмат плоті, сучка…"

            p "..." 

            "В нього ніби пішла піна з рота, ніби він був скажений та він завис."

            p "…"

            p "Не чухай яйця, я ж кушаю ХОЛОДЕЦЬ." 

            p "У мене дядя заправщик, слідкує за комбікормом." 

            p "…"

            p "Крекер аристократи лізли в шлюбку срала в катлаван." 

            "Тарас подумав, що це за хуйня і хотів викинути нахуй той компʼютер через вікно, але компʼютер був важкий бо був зроблений ще у 1999 році і важив десь 17 кг."
            
            "Ну а Тарас нічого не піднімав важчого у своєму житті за його пісюн."

            jump quastions_to_patron


    return

# (Все зводиться до quastions_to_patron) якщо вибрати комбінацію (уточнити) (зробити) (так), то відкриється нова стежка сюжету.





label quastions_to_patron:

    p "Ти можеш задати мені пару питань :3 *Патрон почухав пузо*."

    "Тарас, недовго думаючи, придумав що задати свому новому пухнастому четверолапому другові."

    menu:
        "Тарас, недовго думаючи, придумав що задати свому новому пухнастому четверолапому другові."

        "Який твій біас з бтс?":
            jump bias_bts


        "Ти читав біблію?":
            jump bible


        "Яке любиме аніме?":
            jump favorite_anime


        "Який твій президент?":
            jump your_president


        "Ти любиш кабачки?":
            jump do_you_like_zucchinis


        "Ти скажений?":
            jump are_you_rabid


    return




label bias_bts:

    t "Який твій біас з бтс?"

    p "Хмм... *Патрон задумливо потер своє підборіддя*."

    p "Думаю, що мій улюблений співак з BTS — це Чонгук. Я обожнюю його миле личко. Уявляю як він сидить в мене на ніжках, провокуючи цим, а я його…"

    t "Так, я зрозумів, все, зупинися." 

    p "Ах, да, вибач…"

    t "Мене, якщо чесно, вибішують ці всі гей-попи. Я більше люблю потужну українську пісню." 

    t "Я обожнював слухати пісню “Смарагдове небо” і “Зірочка палай” , в той час коли моя мати сношалася з тими неграми з Тернопільського меду. Потім мені мама дбайливо наливала стакан молока." 

    t "Тільки воно було якимось занадто густим та несмачним, але заплатив — не ний, а в живіт залий, як говориться."

    p "*Патрон ошелешено подивився на Тараса*. Що?"

    t "Що чув. Ладно, йдемо далі, Господи Єгор допоможи." 

    jump quastions_to_patron_2

    return




label bible:

    p "Яке цікаве питання... Взаємодія з текстами такого фундаментального масштабу — це завжди вихід за рамки звичайного читання."

    p "Це доторк до величезного пласту світової культури, історії та філософії, де кожен рядок має безліч прихованих сенсів, метафор та інтерпретацій, що формували людську цивілізацію протягом тисячоліть, а великий вплив вона має і досі."

    "Тарас вирішив припинити це тягнення анальної резини, перш ніж Патрон почав поглиблюватись в народження Ісуса Христа в подробицях."

    t "Так, стоп. Просто скажи, так чи ні, я не хотів Вікіпедії."

    p "Ні, лол."

    t "Ну і нащо тоді це все було?"

    p "... я хз взагалі, мій володарю." 

    t "Ну ок." 

    jump quastions_to_patron_2

    return




label favorite_anime:

    t "Яке улюблене аніме?"

    p "Моє улюблене аніме це Наруто."

    p "В мене є своя ОС, його звуть Ілюша Сербін Покемон Бакуганович та він пускає лесбійський шарінган зі свого шоколадного ока. І він дед інсайд."

    p "Він був дружиною Боруто та вони зробили нову техніку: генделик на ступеньках." 

    t "Звучить хайпово." 

    p "Звісно, я ж сам придумував." 

    t "Це видно." 

    p "Дякую ^^."

    t "Ти мені зараз нагадуєш мого однокласника Петрика." 

    p "*Патрон різко застигнув та подивився на Тараса* Хто такий Петрик?"

    t "Це мій супер охайошеньки даттебайошеньки хлопчик однокласник який робить косплей на всіх персонажів Данганронпи одночасно."

    p "Заздрю, похуй, далі."

    jump quastions_to_patron_2

    return




label your_president:

    t "Який твій президент?"

    p "Мій президент це Володимир Олександрович Зеленський. Тому що ще не вмерла України ні слава, ні воля." 

    t "Цуцику, це ультрамегагіганігасуперпуперкупертупергідромеготеракібер потужно, СЛАВА НАШИМ ЗСУ, ВІЛЬНОМУ НАРОДУ."

    p "*Патрон підійшов ближче до Тараса* Це я для тебе стараюсь, пупсику~"

    t "Сʼїбалось чудіщє, мені вистачає Вовчика."

    p "*Патрон сумно відійшов від Тараса і так само сумно промовив*"

    p "Я навіть питати не буду, хто це."

    jump quastions_to_patron_2

    return




label do_you_like_zucchinis:

    t "Ти любиш кабачки?"

    p "Тільки якщо ти в мене будеш їх сувать~ я мав на увазі ротик! Бака... Кабака." 

    t "Ти їблан?"

    p "*Патрон завмер та опустив голову у звинуваченому жесті*"

    p "Вибач…"

    t "Ладно. В мене просто флешбеки з дитинства."

    t "Мені мама завжди давала кабачки у якомусь дивному майонезі, коли в нас ті її чорні з Нігерії гостили. Вони хуярили один одного голими, той майонез ще нагадував мені смак молока, про яке я згадував." 

    "Патрон знову був в ахуї від почутого."

    jump quastions_to_patron_2

    return




label are_you_rabid:

    t "В тебе немає сказу?"

    p "Що?.."

    "Тарас не очікував, що замість відповіді на питання, Песик неочікувано завмре та почне мертво дивитися в екран."

    t "Еее.. Що? Щось не так?"

    "Патрон тільки через пару секунд Пес прийшов до тями та лише сказав коротко." 

    p "Давай далі. Я не хочу про це говорити П@RАзіt."

    jump quastions_to_patron_2

    return


# Все зводиться до quastions_to_patron_2




label quastions_to_patron_2:

    p "Тарасику, ми ще не закінчили. Знаєш що? Задавай свої питання далі."

    menu:
        "Тарасику, ми ще не закінчили. Знаєш що? Задавай свої питання далі."

        "Любиш маму?":
            jump do_you_love_mom

        "Яка любима конфетка рошен?":
            jump favorite_candy

        "Улюблений гетьман?":
            jump favorite_getman

        "Любімий співак?":
            jump favorite_singer

        "Які чипси полюбляєш?":
            jump favorite_chips
        
        "Що тебе збуджує?":
            jump what_makes_you_horny

    return




label do_you_love_mom:

    t "Любиш маму?"

    p "Так, але... *Патрон трошки поник та тихо продовжив*"

    p "Просто... Моя мама померла коли я народився. Мені дуже тяжко це згадувати. Не розумію, чому вона так вчинила."

    t "Ну ясно. А мені моя мама говорила, що краще б вона мене висцяла на крапиву." 

    p "Мені дуже прикро це чути. Вибач, що я змусив тебе це згадати."

    jump quastions_from_patron

    return




label favorite_candy:

    t "Яка улюблена цукерка Рошен?"

    p "Моя улюблена цукерка Рошен - це шипучка. Я обожнюю такі супер кислючі штучки, щоб аж їбало розʼїдало та піна з рота перла, як з фонтана. Тільки…"

    p "*Він зробив невелику паузу*.
    Колись я зі своїм другом грали в гру лисичку. Ми нахуярювались цими шипучками і стояли як сольові. Через це нас часто і приймали за сольових та від ненависті сцяли нам в роти."

    p "Нам хоч і смачно було, але краще б вони сцяли у Секайчику."

    t "Прийнято. Моя однокласниця грає в Секай. Маринка. Тільки вона мене динамить. Дурепа моя маленька, не баче свого щастя."

    jump quastions_from_patron

    return




label favorite_getman:

    t "Улюблений гетьман?"

    p "Мій улюблений Гетьман - це Іван Виговський."

    p "Мене збуджують його амбіції, цілеспрямованість та його шалені вусики. Я уявляю, як він лоскоче ними мою дірочку…" 

    p "Мммм…"

    p "*Патрон аж тихо простонав від своїх же слів*."

    p "А може... ти будеш це робити?.. у тебе якраз такий гарний пушок на вусах…"

    t "Я краще втоплюся в молоці після нігерів медиків." 

    p "Добре, вибач…"

    jump quastions_from_patron

    return




label favorite_singer:

    t "Улюблений співак?"

    p "Мій улюблений співак - це Melovin. Він такий милашка, я просто не можу втриматися. Хочеться надломити його гордість."

    t "А в мене це Маша Кондратенко. Ти не потужний. Помри." 

    t "Ванька-встанька, що таке? Приготуй собі пакет."

    p "*Патрон завмер* Щ-що?" 

    t "Ну добре, цуцик, вибач, я так не буду." 

    p "*Він тихо схлипнув, але сопля все ж таки потекла з носу по губах* Добре…"

    jump quastions_from_patron

    return




label favorite_chips:

    t "Які чіпси полюбляєш?"

    p "Я полюбляю чипси зі смаком дерунів, грибів і сметанки. Вкусняшка." 

    t "Цікаво. Тільки такого гівна ще на світі не існує."

    p "В сенсі?! *Патрон різко встав з інвалідної коляски* Мені моя мати їх завжди купляла на Касьянов день!" 

    t "А, ну тоді ок, це дуже змінює ситуацію." 

    jump quastions_from_patron

    return




label what_makes_you_horny:

    t "Що тебе збуджує?"

    p "Мене збуджує твій сексуальний анальний отвір, і твій пушок на вусах, і ножки, і весь ти солоденький~"

    p "*Він знов прижав Тарасика до стіни, гаряче дихаючи йому в обличчя*" 

    "Тарас вже перебував у квадріхуї від такого розкладу подій та знов сказав." 

    t "Я тебе просив не домагатися мене, дибіляка ти тупа." 

    p "*Завмер на місці та після цього відпрянув назад* Ой, вибач, зовсім забув…"

    jump quastions_from_patron

    return


# Все зводиться до quastions_from_patron




label quastions_from_patron:

    p "Солоденький, давай тепер я задаю тобі питання…"

    p "Тож… Можна задати тобі одне питання?"

    t "Так." 

    "Відповів Тарас так, ніби його вже нічого не здивує." 

    p "*Патрон трошки підійшов ближче до Тарасика*"

    p "Воно дуже особисте, ти можеш не відповідати, якщо не хочеш…"

    t "Та да."

    p "*Патрон підійшов ще ближче на крок та нагнувся до вуха Тараса* Точно?"

    t "Бля, да точно, і давай скоріше бо мені ше в Роблокс за тунтунтун сахура грати." 

    p "*Патрон перейшов на шепіт* В тебе є бойфренд?"

    "Тарас знову ахуєл." 

    "Він аж згадав як хотів зняти фемелі лінк на маминому телефоні та знайшов дік пік батька та повідомлення від якогось Валери СТО: Сьогодні вночі я відлижу тобі анус."

    t "Не знаю, чи можна вважати Вовчика за бойфренда…" 

    p "*Патрон різко застиг та нахмурив брова* Хто…?"

    t "Вовчик це моя няшечка вкусняшечка." 

    p "*Повільно убрав руки від Тараса* Вибач........."

    t "Ну ок, лол кек чебурек." 

    p "Добре, можна ще одне питання? Останнє, чесне слово." 

    t "Так, звісно." 

    p "Воно теж дуже особисте."

    t "Задавай вже йопрст."

    p "Тобі хтось подобається?"

    t "Ні, ну це якийсь піздєц. Ну добре, є в мене одна пасія."

    p "Ого, а хто? Якщо не секрет." 

    t "Не скажу, не твоє псяче діло якраз." 

    p "*Патрон знову замер та відійшов від Тараса*" 

    p "Добре…" 

    t "Це всі запитання?"

    p "Так, звісно. Дякую за таку щиру бесіду, коханчику."

    p "До завтра." 

    t "Ну оке, я поїхав." 

    p "*Патрон у останній момент схопив Тарас за запʼястя* Стій! Ти куди?..."

    t "Діла вирішувати з тим Вовчиком, і ти казав, що це вже кінець!"

    p "Я хочу задати тобі ще одне запитання…"

    t "Та ти заїбеш, ти ж говорив, що це останнє!" 

    p "*Патрон засмутився, але лише знов сказав*" 

    p "Воно... Дуже.. дуже особисте. Але я хочу щоб ти на нього відповів... Але.. якщо не хочеш - я тебе не змушую…"

    t "Бля, вже третій раз це кажеш, ну давай, питай." 

    p "*Патрон глибоко вздохнув та підійшов ближче* Скажи... ти.. незайманий?..."

    t "...Шо блять?"

    p "*Патрон почервонів до коренів волосся*"

    p "Просто я... так.. і... Я хотів би зараз сказати... Що я хочу бути зверху."

    t "Ні, це зовсім жах якийсь, Песику, іди нахуй." 

    p "Добре, вибач мені... *Пес патрон сумно сів на свій фулл потужний мотик блакитно жовтого кольору, але перед цим він сказав через плече:*" 

    p "Бувай… Хоча… я маю ще одне питання, але я напевно вже не буду тобі його задавати, якщо ти поспішаєш…"

    "Тарас роздягнувся, на ньому лишились тільки його труси, хоча по їхньому стані вони більше нагадували стрінги і він ліг спати." 

    if choice_specify and choice_eat_strawberry and choice_yes:
        jump rule_34_patron

    else:
        return

    return




label rule_34_patron:

    p "Ти… просто памʼятай, що я продаю свої хтивки за 6 українські фулл потужні грівни і 7 копійок. Бажаєш купити?"

    t "Давай~"

    "Патрон поїхав на своєму мотоциклі та з вихлопу вилетів зіп файл під назвою “Rule 34 Pes Рatron”."

    t "Та нє, мені на сьогодні вистачить."

    "Тарас роздягнувся та ліг спати." 

    "Тарасу снилося, як його батько водить хороводи з хомʼяками. Марінка стала сігма шкібеді бейблейд туалетом та почала робити сальто і різко впала на центр хороводу баті і хомʼяків."

    "Та прилетіла його ОС по данганронпі харканка Пуздане абсолютна Лезбіянка та почала їбатися з Марінкою в центрі того хороводу і Тарас заплакав. Кожна його сльоза важила безмежність горя, яке він відчув, бачачи цю картину."

    "Він ще довго на це дивився та не помітив, що йому вже перестало щось снитися, тільки зірочки літали перед очима і хтивки Пса Патрона."

    return


















        



    








