# Пролог

# Игра начинается здесь:
label start:

    scene bg grass:
        xysize (1920, 1080)
    with fade

    '''
    На дворі був кінець травня, сонце світило як ніколи яскраво, а пташки співали свої любовні симфонії.

    В той же час Тарас Федько якраз повертався зі школи після останнього дзвоника.

    Настрій в нього був, наскільки можна сказати, поганий. Навіть кінець навчального року не викликав у нього радісних почуттів.

    А все через те, що всі його братани вже познаходили собі пасії. Навіть його обриганий однокласник Петро, який і вмів тільки грати в Доту і їсти козявки за першою партою.

    А йому відмовила в коханні однокласниця Марина, за якою він бігав останні два місяці.

    В додаток, сусід по парті зізнався йому в почуттях, його найкращий друг Володя. Вова, як він міг!?

    Вони ж так любили зависати разом за гаражами і грати в Бравл Старс та Роблокс!

    Тарас і сам не помітив, як дістався до дому. Останній раз глянувши на мальовничий пейзаж позаду, хлопець  ступив у засцяний під9їзд.
    '''


    scene bg corridor:
        xysize (1920, 1080)
    with fade

    "Він зайшов до своєї маленької квартири, яка була, як завжди, пуста і одинока, бо його батьки поїхали в Дубаї на вечірку якогось Ейнштейна, а його не взяли."

    "Він викликав ліфт, який бомжі використовували як туалет, та піднявся на свій дванадцятий поверх."

    play sound door

    scene bg hall:
        xysize (1920, 1080)
    with fade


    "Зайшовши до квартири, він, швидким рухом знявши свої оригінальні макасіни з базара, підійшов до свого старого, задрипаного комп9ютера."

    scene bg desktop:
        xysize (1920, 1080)

    $ renpy.movie_cutscene('videos/windows_startup.webm')

    scene bg desktop:
        xysize (1920, 1080)


    "Легким рухом сівши за стілець, який дуже хитався, він ввімкнув пристрій."

    play sound notification

    "Неочікувано, на його Телеграм прийшло нове повідомлення. Воно виявилося від Вови. Ох, Вова, Вова, його він точно не хотів зараз чути!"

    "Але, завмерши на хвилину, він все ж натиснув на цю назойливу іконку контакту з Леоном на аватарці, що в 10-Г був самим популярним героєм."

    scene bg telegram:
        xysize (1920, 1080)

    "В чаті не було якихось пояснень або тверджень, що все було жартом, лише одне дивне посилання. Майже не думаючи, Тарас натиснув на нього."

    scene bg site scary:
        xysize (1920, 1080)

    "Раптом, екран почорнів як після довгої катки в Бравл Старс, а потім на ньому зʼявився сайт “Сасні тьолки”. Тарас аж відпрянув від неочікуваності."

    show three bots 

    "На ньому з9явилися три людини неперевершеної зовнішності, наче найсвіжіші булочки після шести уроків." 
    
    "Вони були еталоном стандартів краси, навіть гарніше Марининого ліфчика, що одного разу в неї “випадково” впав на уроці фізкультури з Юрієм Григоровичем."

    "Погляд його спочатку зосередився на пишногрудій красуні."

    "Очі були такі глибокі, як вода у текстах їхньої вчительки української мови, Валентини Іванівни."

    "А губи настільки пишні, наче лопнуть від одного дотику."

    "Потім на тендітну фуррі-дівчину, яка так і дивиться своїм сексуальним взором, наче ось-ось наброситься і оближе тебе від п9яточок до пухнастої макушки.А які в неї вушка, ммм."

    "А третя була схожа на його вчительку молодшої школи. В неї була така сама молодіжна зачіска, що так і приваблювала молодше покоління, строгі блакитні очі та довгі, широкі руки, які наче хотіли поділитися теплом з навколишнім світом."

    t "Що за чорт? Ну добре, оберу когось. Можливо, це якись сайт для ролок з ботами."

    jump vubor_bota



    return


label vubor_bota:

    menu:
        "Що за чорт? Ну добре, оберу когось. Можливо, це якись сайт для ролок з ботами"

        "Пес":
            hide three bots
            
            jump vubor_patron

        "Патріотична жінка":
            hide three bots
            "Він натиснув на жінку з русим волоссям та прапорами НЕНЬКИ УКРАЇНИ на щоках."
            jump vubor_olga

        "Дивовижна вчителька":
            hide three bots
            "???"

    return
