# Ветка Ольги

label vubor_olga:

    show bg desktop empty:
        xysize (1920, 1080)

    "Сайт одразу закрився та Тарас опинився на своєму робочому столі. Він так перелякалася, що вдарився мізинцем об шафу."

    t "Дідько, щоб його шляк трафив!  Е-е-е, куди? Що за хуйня? І де моя обіцяна грудаста тьолочка? Навіть пікселі динамят..."

    show olga

    "Раптом, перед ним на моніторі виплила картинка патріотичної жінки. Тарас настільки зрадів, що аж забув про мізинець."

    t "О, я думав, наїбали. Все ж тяночки ніколи не зрадять."

    "Картинка пристально подивилася на Тараса, перевіряючи наявність глистів в м'ясі, і раптом запитала."

    a @ say "Вітаю, козаче! Чому не на фронті?"

    menu:
        "Вітаю, козаче! Чому не на фронті?"

        "Мені ще 22 нема.":
            jump not_22

        "А ти хто?":
            jump who_are_you

        "Пішла на хуй, уєбанка.":
            jump fuck_off

        "Чому не на фронті?":
            jump why_not_front

        "Вова, це ти?":
            jump vova_is_that_you



    return








# Вопрос: "Вітаю, козаче! Чому не на фронті?"

label not_22:

    t "Мені ще 22 нема, мені тільки 18, але як тільки наступить, я одразу побіжу захищати НЕНЬОЧКУ УКРАЇНУ!"

    a @ say "О, наш козак. Ти дуже потужний."

    o @ say "Я Ольга UA, твій новий Інтернет-друг, давай спілкуватися."

    jump scene_o2

    return


label who_are_you:

    t "А ти хто така? Ти вірусяка?"

    o @ say "Ні, Я Ольга UA, твій новий друг. І мене набагато складніше витравити, ніж вірус. Я живучіша за тараканів у твоїй квартирі, що вже в'їлися намертво в шпалери і ніколи звідти не вийдуть." 

    jump scene_o2


    return


label fuck_off:

    $ screw_olga = True

    t "Aх ти підораска, пішла нахуй, уєбанка. Ніякої від тебе користі, думав, хоч сіськи покажуть... Немає сечі терпіти ці пекельні борошна!"

    a @ angry say "Ах ти вишкварок, падлюка, ти помреш в пекельних муках!!!"

    a @ angry say "Огида!"
    a @ angry say "Огида!"
    a @ angry say "Огида!"
    a @ angry say "Огида!"
    a @ angry say "Огида!"
    a @ angry say "Огида!"
    a @ angry say "Огида!"
    a @ angry say "Огида!"
    a @ angry say "Огида!"
    a @ angry say "Огида!"

    show olga angry

    "Жінка на секунду замовкла, але Тарас навіть не встиг отямитись, як почала знову та ще голосніше, і навіть не думала зупинятися."

    a @ angry say '''
    Нікчемна аскарида!

    Нікчемна аскарида!

    Нікчемна аскарида!

    Нікчемна аскарида!

    Нікчемна аскарида!

    Нікчемна аскарида!

    Нікчемна аскарида!

    Нікчемна аскарида!

    Нікчемна аскарида!

    Нікчемна аскарида!
    '''

    "Комп почав дуже шуміти та жінка почала розпливатися. Тарас подумав, що все ж не треба було їсти ту злощасну смердючу рибну котлету в столовій. Він же одразу зрозумів, що з нею було щось негаразд…"

    a @ angry say '''
    Чому не на фронті!?

    Чому не на фронті!?

    Чому не на фронті!?

    Чому не на фронті!?

    Чому не на фронті!?

    Чому не на фронті!?

    Чому не на фронті!?
    
    Чому не на фрон...
    '''
    "Хлопчина вже не витримав та закричав в монітор. Його голос розлетівся по всьому будинку. В квартирі зверху хтось наполегливо поступав по батареях."

    t "ТА ЗАСПОКОЙСЯ ВЖЕ!!! Вибач, я більше так не буду. Можеш, будь ласка, не кричати на мене? В мене психологічна травма залишилась після криків моєї мами, в яку вселився демон, і з якої потім його виганяв ведучий телепередачі Реальна містика…"

    show olga

    "Як тільки він це сказав, все стало гаразд та перед ним була звичайнісінька жінка, яка була перед ним хвилину назад. Той самий погляд, ті самі губи, ті самі груди…"

    o @ say "Добре, ухилянте, я думаю, ти зрозумів. Я Ольга UA, твій новий друг. Якщо ще раз мене обозвеш, я включу Ваньку-встаньку."

    jump scene_o2


    return


label why_not_front:

    t "Чому не на фронті???"

    a @ say "Я на фронті, а ти?"

    t "Е-е-е-е? Що?"

    o @ gloomy say "Нічого, я бачу, ти недалекий. Я Ольга UA, твій новий друг. Допоможу тобі трохи розвинутись."

    jump scene_o2


    return:


label vova_is_that_you:

    t "Вован, це ти?"

    o @ gloomy say "Ні, я Ольга UA, твій новий друг. Невже я схожа на чоловіка? Не порівнюй мене з цими жахливими створіннями."

    jump scene_o2


    return

# Конец ответа. Все сходиться к scene_o2








label scene_o2:

    "Тарасік помітив, що всі іконки програм зникли на його робочому столі. Хіба не піздец? Ох, Вовчик-скотиняка. А ще в коханні зізнавався... Напевно, вірусів наприсилав."

    t "Ольга UA, чому на моєму робочому столі немає ярликів? Як мені тепер бути? Там же була збережена найважливіша частина мого життя"

    "Тарас був ошелешений і не розумів, що коїться з його любим комп’ютером. Якщо він накриється мідним тазом, йому буде настільки нудно, що почне виконувати свої багаточисельні борги по математиці."

    "Він придбав його за цілих сто гривень у сусіда-алкаша, що любить бігати по вулиці голим. Сусід виставив комп'ютер на OLX і коли Тарас побачив знайомий нікнейм, одразу здогадався, кому він належить і побіг ловити сусіда."
    
    "Він навіть тоді випросив знижку, бо пригрозив, що розкаже мамі про нову розсаду квітів, яку той алкаш витоптав."
    
    "Цей компʼютер був з ним ще з восьми років і пережив з ним все."
    
    "Його сварки з батьками, які хотіли викинути новий гаджет у вікно через деградування синочки; його дуже сміливі експерименти зі слаймами, які ніколи не виходили без загущувача;"
    
    "гомункулів, пубертатний період з його постійним прагненням до знань і, звісно, всі його сумні та депресивні моменти життя. Тільки він рятував його від імпульсивного виходу у вікно та слоїки з вишнею на руках  в тринадцять років."
    
    "А зараз він би як ніхто допоміг скрасити печаль від того, що Маринка не прийняла його щирі почуття і послала на кудикіни гори."
    
    "Сказати, що він був його центром життя - це нічого не сказати."


    
    o @ say "Я їх прибрала, щоб вони не заважали нам спілкуватися та не відволікали тебе від наших інтелектуальних розмов."
    
    o @ gloomy say "Тим паче, в тебе стільки вірусів там було. I ті твої говно Дота 2 та Роблокс, які віднімають твоє IQ і, певно, впливають на кількість хромосом, що видно з твоїх геніальних умовиводів."
    
    o @ gloomy say "Сумніваюсь, що тобі вже щось допоможе, але я хоча б спробую."
    
    o @ gloomy say "А про твої папки я взагалі мовчу. Там настільки все жахливо, що очі нікуди діти. Тобі взагалі не соромно? Мені здається навіть у файлах того знаменитого фізика все не настільки страшно було."
    
    "В один момент лице Тараса почервоніло, як у рака після кидання в окроп, та він заверещав, наче та свиня, тільки вже після іншого способу приготування."


    
    t "ТИ ЛАЗИЛА ПО МОЇХ ПАПКАХ!!! ЦЕ МІЙ ОСОБИСТИЙ ПРОСТІР!!!"
    
    t "МЕНІ ПСИХОЛОГ КАЗАВ, ЩО ЦЕ МОЯ ЗОНА КОМФОРТУ, НЕОБХІДНА ДЛЯ ЗБЕРЕЖЕННЯ ІНДИВІДУАЛЬНОСТІ ТА ПСИХІЧНОГО ЗДОРОВ'Я, І НІХТО НЕ МАЄ ПРАВА ЇЇ ПОРУШУВАТИ!!!"

    t "ЧУЄШ?! НІХТО!!!"



    "По його обличю потекли сльози, а його щоки ще більше почервоніли, наче рак уже на стадії готовності."

    o @ say "Я навіть не хочу в голос говорити, що я там побачила. Я б викликала на тебе поліцію, якби не була зацікавлена в спілкуванні з тобою."

    "Вона говорила це з насмішкою, наче хотіла пристидити."

    t "Ох, дай хвилинку. Я піду на кухню, змию всі свої гріхи та заспокоюсь."

    o @ say "Добре. Піди заспокойся, приведи себе до ладу, а я поки що тебе почекаю та послухаю “Зірочка, палай”. "
    
    o @ gloomy say "Надумаєш збігти, я тобі по блютузу рак яєчка передам."

    hide olga

    scene bg kitchen:
        xysize (1920, 1080)
    with fade

    "Тарас встав з стільця та пішов на кухню, вмився холодною водою та сів на ще більш розйобану табуретку."

    t "Ой, як мені соромно, що я родися на цей світ таким розпусним."

    t "Треба було все ж тоді погодитися на пропозицію тих Свідків Єгора, чи як їх там, що так і ходили у нас під домом у той злощасний четвер!"

    t "Вони розказували про свого Єгора і як вони потраплять у рай! Можливо, я б уже був в раю, разом з Єгором, і ми б разом культивували свої чакри і чистоту душі!"

    t "Сподіваюсь, ця Оля просто сон і це скоро закінчиться, і все буде як раніше. В крайньому випадку, все ж прийдеться йти їх шукати по сусідах."

    t "Господи Боже Єгор, помилуй мене. Якщо це сон, я буду молитися тобі кожного дня три рази на день."

    "Він ще посидів десять хвилин та заснув. Табуретка під ним почала тріщати."

    "Йому снилося, як він з Маринкою грає весілля та рожає дітей. Чомусь вони підозріло були схожі на Вовчика..." 

    "Перед тим, як він встиг про це глибше подумати, його сон раптом перервав голосний хруст, це була табуретка під його сракою."

    "Він впав на підлогу, як той пеніс його батька при виді його матері."

    "Він швидким рухом встав з підлоги та голопом по Європі побіг до кімнати."

    scene bg desktop:
        xysize (1920, 1080)
    with fade

    show olga

    o @ say "О, ти повернувся, Тарасик. Я тобі дещо хотіла показати."

    jump vubor_olga_2


    return



label vubor_olga_2:

    menu:

        "О, ти повернувся, Тарасик. Я тобі дещо хотіла показати."

        "Перебивати":
            jump perebit

        "Слухати далі":
            jump sluhati_dali

    return


label  perebit:
    
    t "А знаєш що? Я не буду це слухати. Я вимикаю комп’ютер."

    o @ gloomy say "Ти не можеш цього зробити, ти будеш спілкуватися зі мною."

    t "Чого б це? Кріпосне право відмінили ще в 1861 році."

    o @ say "Подивись на екран."

    t "Не хочу."

    o @ say "Ти маєш це подивитися."

    t "Ні."

    o @ gloomy say "Ох, я бачу, ти недалекий. Зараз ти в мене далеко полетиш."

    t "Добре, включай. Ти мене доконала."

    o @ say "Окей."

    "Ольга UA зникла з екрану, а замість неї зʼявилося відео, де батьки Тараса були звʼязані."

    "Вони були змучені та худі. Здається, кормили їх так само, як їв власник Макдональдсу, коли пробував свою їжу."

    "Мати була наче скелет, люба б анорексічка позаздрила, а батько майже не рухався, лише дивився своїм голодним поглядом, як та знаменита Момо, що колись обіцяла його знайти і прийти."

    "Відео зникло та Ольга UA знову зʼявилася на екрані."

    o @ say "Ну що, тепер будемо спілкуватися? Або ти далі будеш вередувати, пупсику?"

    t "Да мені ваще похуй. Іді нахуй."

    "Тарасу було все одно, тому що батьки його ніколи не любили так сильно, як йому хотілося."

    "Постійно забирали комп'ютер, змушували робити математику, а ще пічкали цими огидними кашами і супами з цибулею."

    "Як вони могли?! Вони знали, як він не любив цибулю, але все одно додавали її."

    show olga surprised

    o "Ох…"

    "Ольга UA була здивована, але в неї був козир в декольте."

    show olga 

    o @ say "Тоді я розішлю твої ганьбливо-огидні файли твоїм друзям, поліції та адміністрації школи. Подивимося, як вони опісля подивляться в твої сороміцькі очі."

    o @ say "Як же кумедно буде спостерігати за твоїм соціальним падінням, коли ти впустиш мило у вʼязниці!"

    t "Ні, будь ласка, я зроблю все що захочеш!" 

    jump quastion_1

    return


label sluhati_dali:

    "Ольга UA зникла з екрану, а замість неї зʼявилося відео, де батьки Тараса були звʼязані."

    "Вони були змучені та худі. Здається, кормили їх так само, як їв власник Макдональдсу, коли пробував свою їжу."

    "Мати була наче скелет, люба б анорексічка позаздрила, а батько майже не рухався, лише дивився своїм голодним поглядом, як та знаменита Момо, що колись обіцяла його знайти і прийти."

    "Відео зникло та Ольга UA знову зʼявилася на екрані."

    o @ say "Ну що, тепер будемо спілкуватися? Або ти далі будеш вередувати, пупсику?"

    t "Да мені ваще похуй. Іді нахуй."

    "Тарасу було все одно, тому що батьки його ніколи не любили так сильно, як йому хотілося. "

    "Постійно забирали комп'ютер, змушували робити математику, а ще пічкали цими огидними кашами і супами з цибулею."

    "Як вони могли?! Вони знали, як він не любив цибулю, але все одно додавали її."

    show olga surprised

    o "Ох…"

    "Ольга UA була здивована, але в неї був козир в декольте."

    show olga

    o @ say "Тоді я розішлю твої ганьбливо-огидні файли твоїм друзям, поліції та адміністрації школи. Подивимося, як вони опісля подивляться в твої сороміцькі очі."

    o @ say "Як же кумедно буде спостерігати за твоїм соціальним падінням, коли ти впустиш мило у вʼязниці!"

    t "Ні, будь ласка, я зроблю все, що захочеш!"

    jump quastion_1

    return


# Конец ответа. Все сходиться к quastion_1

label quastion_1:

    "На його обличчі чітко читався страх."

    o @ say "Так, починаємо спілкування. Я буду задавати питання про твоє бентежне життя."

    o @ say "А ти будеш відповідати на них або робити певні дії, нічого складного, лише повна покора і лизання моїх брудних п'ятачок."

    o @ say "Зрозумів, мій маленький цуцик?" 

    "Тарас був дуже здивований, що вона не попросила його перевести всі свої гроші на якусь підозрілу картку, які він так довго збирав на нове оновлення в Бравл Старс."

    "Або пригнути з дев'ятого поверху, як у відомій грі його дитинства з якимось гомосексуальним китом."

    "Він трішки заспокоївся та впевнено сказав."

    t "Окей. Роби зі мною. що хочеш. Заради тебе я можу навіть купити хвостик та вушка на Аліекспрессі."

    o @ say "Який твій любимий бравлер?"

    jump favorite_brawler


    return



# Вопрос: Який твій любимий бравлер?

label favorite_brawler:

    menu:

        "Який твій любимий бравлер?"

        "Леон":
            jump leon

        "Шеллі":
            jump shelli

        "Кіт":
            jump kit

        "Едгар":
            jump edgar

    return


label leon:

    t "Я люблю Леона, він нагадує мені про мого найкращого друга Вову… Вовчик-Вовчик... Він був таким же зеленим проказником. Ох, як же він казився."

    o @ surprised "Ви посварилися?" 

    t "Ну, ми сиділи на математиці та слухали нашу любу вчительку Ганну Феліксовну, а він передав мені папірець, на якому було написано…"

    "Тарас задумався та скривився, наче той в'ялений грибочок." 

    o @ gloomy say "Ну, що там було? Кажи, інакше хвостика не виманю."

    t "Не хочу говорити. Це занадто болюча тема для мене. Ми були наче той Леон і Сенді, справжні братани. Кожної ночі він приходив до мене і ми проходили по п'ятдесят каток, а потім він лягав спати під моє ліжко, і я слухав його томне дихання."

    o @ say "Окей. Не буду згадувати про твого колишнього."

    jump quastion_2


    return


label shelli:

    t "Я люблю Шеллі. Хоч вона і підозріло схожа на Петрика, отого довбоящера з жовтими козявками. Її великі теплі руки здаються такими м'якими. А її неперевершена зачіска схожа на дуже смачний спілий виноград, про який розказував мені дід Гріша. Ой, як він виріс після взриву в Чернобилі."

    o @ say "Sounds nice."

    jump quastion_2

    return


label kit:

    t "Я люблю Кіта. Він нагадує мені мою кішку Багіру, яку загриз мій сусід-алкаш, у нього закінчились сир косичка, тому він з'їв її як закуску під чекушку. Вона була з найсильніших. Боролася до кінця."

    o @ say "Це дуже круто. Сподіваюсь, ти не підеш по стопам сусіда."

    jump quastion_2

    return


label edgar:

    t "Я люблю Едгара. Він схожий на друга моєї мами, в нього дуже підозріле і голодне обличчя. Думаю, він як і дядя Толік приходить в свою халабуду і здирає все, що бачить в холодильнику."

    o @ say "Ти дуже крутий. Я теж люблю фембойчиків."

    t "Дякую. Твої слова багато значать для мене."

    jump quastion_2

    return

# Конец ответа. Все сходиться к quastion_2



# Вопросы про типаж

label quastion_2:

    o @ say "Так, прекрасно, тепер я знаю про тебе більше. Що ж, тепер друге питання: що тобі подобається в дівчатах, який в тебе типаж? Любиш пікмі чи сигм?"

    menu:
        o "Що ж, тепер друге питання: що тобі подобається в дівчатах, який в тебе типаж?"


        "Блондинки":
            jump blond

        "Брюнетки":
            jump brunette

        "Лисі":
            jump bald

    return


label blond:
    t "Я люблю блондинок. Я думаю, в них дуже гарне волосся на лобку. В мене з дитинства є такий фетіш."

    o @ say "О, це ж я, як мило. Але, на жаль, лобка в мене немає. Не допрацювали пікселі."

    t "Взагалі-то ні. Маринка – блондинка. Я її люблю понад усе. Ми будемо разом, я вийду за неї заміж, і ми народимо Вовчика."

    "Ольга UA трохи розлютилася, але виду не подала."

    o @ say "Далі."

    jump quastion_3

    return

label brunette:

    t "Я люблю брюнеток. Як шоколадка Рошен. Вони такі ж смачні і солодкі, як цукерка, що тане в роті."

    o @ gloomy say "Дуже добре, але не потужно. Далі."

    jump quastion_3

    return


label bald:

    t "Я люблю лисих. Не переношу волосся де-небудь. Не хочу їсти пюрешку з клубками волосся в себе в тарілці. А ще краще, якщо і на обличчі їх не буде, бо зараз пішли якісь чутки про лобкових вошей на бровах і віях. А таке я точно терпіти не стану."

    o @ say "Цікавий вибір, продовжуй."

    jump quastion_3

    return


label quastion_3:

    menu:
        " "

        "Худих":
            jump skinny

        "З формами":
            jump with_forms

        "Товстих":
            jump fat 

    return


label skinny:

    t "Я люблю худих, щоб аж ребра було видно. Я ж песик, мені потрібна лише одна кісточка, щоб вгамувати мій голод. Маринка теж худа, як я люблю."

    "Тарас з блаженною посмішкою, як в того алкаша, подивився в монітор."

    o @ angry say "Ми зараз не про твою Маринку говоримо. Закритий пельку, і говори не як дурбецало, а то я тобі помщуся."

    show olga angry

    t "Навіть помріяти не даєш, жах."

    show olga

    o @ say "Додай на останок ще щось."

    jump quastion_4

    return


label with_forms:

    t "Я люблю таких дівчат, щоб срака як гарбуз, а цицьки як дві дині. Щоб було що понюхати і за що вхопитися."

    o @ say "Хм, чому ти описуєш мене? Цікаві в тебе аналогії, продовжуй."

    jump quastion_4

    return


label fat:

    t "Я люблю таких, щоб складок було багато та були великі, мʼякі та теплі. Це прям смак. В дуже голодні і холодні часи їх можна використовувати як масло, вичавлюючі жир з живота, та жарити собі гренки."

    o @ say "Ну, кожному своє, давай на кінець ще щось."

    jump quastion_4

    return


label quastion_4:

    menu:
        " "

        "Спокійних":
            jump calm

        "Драйвових":
            jump drive

        "Як мама":
            jump like_mom

    return


label calm:

    t "Люблю таких, щоб сиділи дома, любили тільки мене, готували дітей та народжували мені борщі. Схожі на Маринку."

    o @ say "Прекрасно, тепер я знаю, які дівчата тобі подобаються."

    if screw_olga:
        jump night1_if_screw_olfa

    else: 
        jump night1
        

    return


label drive:

    t "Люблю таких, щоб завжди щось робили, щоб можна було сходити на риболовлю, а потім разом топитися в річці. Щоб з ними завжди було весело та круто."

    o @ say "Таких як я? Я теж можу втопити тебе в річці~"

    t "Ні, іди нахуй."

    o @ gloomy say "Ти дограєшся. Я ж тебе вже попереджала."

    t "Добре, мовчу."

    o @ say "Прекрасно, тепер я знаю, які дівчата тобі подобаються."

    if screw_olga:
        jump night1_if_screw_olfa

    else: 
        jump night1


    return


label like_mom:

    t "Я люблю таких, як моя мама, щоб верещали, бухали, пропадали на два роки та варили мівіну Дорблю з селедкою в гівні."

    o @ say "Ну, батьків не обирають. Страшно, це дуже страшно. Вдачі тобі з твоїми вимогами. Мені вже тебе шкода."

    o @ say "Прекрасно, тепер я знаю які дівчата тобі подобаються."

    if screw_olga:
        jump night1_if_screw_olfa

    else: 
        jump night1



    return




# Конец ответа. Все сходиться к night1.

label night1:

    o @ say "Що ж, Тарас. Вже 22:05. Ти повинен спати. Бо прийде Бабай волохатий і забере тебе під ліжко."

    t "Яке спати, я в такий час тільки сідаю хуярить в Доту. І під ліжком може бути тільки Вовчик, а його я точно бачити не хочу."

    o @ gloomy say "По тобі видно. Так, я сказала іди спати."

    o @ say "Тобі потрібно поспати перед важким днем, а я поки проаналізую наші з тобою розмови."

    o @ say "Можеш, будь-ласка, не вимикати комп’ютер на ніч? Я хочу подивитися, як ти спиш."

    menu:
        "Можеш, будь-ласка, не вимикати комп’ютер на ніч? Я хочу подивитися, як ти спиш."

        "Вимкнути":
            jump turn_off

        "Не вимикати":
            jump not_turn_off

    return


label turn_off:

    t "Ні, вибач, раз ти хочеш, щоб я добре спав, то мені потрібна повна темрява."

    o @ surprised "Стій, не вим-"

    scene black

    "Не встигла вона договорити, як він вимкнув комп’ютер."

    "Тарас розправив ліжко, зняв з себе одяг та ліг спати."

    scene bg mobile1:
        xysize (1920, 1080)

    $ renpy.movie_cutscene('videos/mobile1.mkv')

    scene bg mobile1:
        xysize (1920, 1080)
    
    "Йому приснилося як він їхав по полю верхом на Вовчику, а потім вони пішли в булочну і купили двадцять дев’ять пасочек і він скормив їх всі Вовчику."

    "Далі Вовчик чомусь став пасхальним яєчком і запригнув йому в нові кросівки і став масирувати п'яточки. Йому це чогось не сподобалося і він викинув кросівок в голову сусіда."

    "Зрештою, в Тараса виросли крила і він полетів підкорювати Роблокс."

    return


label not_turn_off:

    t "Окей, тільки не шуми та не заважай спати. Бо я спросоння можу викинути тебе у вікно."

    o @ say "Без проблем. Зі мною твій сон завжди буде дуже солодким, я по блютузу передаю тобі феромони щастя, тому ти ніколи не будеш прокидатися від кошмарів."

    "Тарас розправив ліжко, зняв з себе свої задрипані штани з машинкою Макквін, залишивши лише чорні, диряві боксери з вільним входом, але довго не міг лягти спати, бо світло монітора та його включеної веб-камери не давало йому спати."

    "Але все таки заснув."

    scene bg mobile2:
        xysize (1920, 1080)

    $ renpy.movie_cutscene('videos/mobile2.mkv')

    scene bg mobile2:
        xysize (1920, 1080)
    
    "Йому приснилося як вони з Маринкою пішли у кіно на фільм про якісь вибори і кохання. Але там чомусь показували якісь дивні едіти з Януковичем і Миколою Азіровим."

    "Коли вони з Маринкою вже думали іти звідси, в кімнату забіг дуже переляканий кінь на двох ногах і почав співати про своє кохання." 
    
    "Перелякавшись, Тарас вибіг, залишивши Марінку з конем, і побіг до Національного університету Повітряних Сил."

    "Там його здибав голова приймальної комісії і він вступив на спеціальність будування шахедів." 
    
    "На першій практиці він збирав по частинах свого друга Вовчика, а потім на ньому полетів на Білгород."

    return




#  Версия ночи, если послать Ольгу

label night1_if_screw_olfa:

    o @ say "Що ж, Тарас. Вже 22:05. Ти повинен спати. Бо прийде Бабай волохатий і забере тебе під ліжко."

    t "Яке спати, я в такий час тільки сідаю хуярить в Доту. І під ліжком може бути тільки Вовчик, а його я точно бачити не хочу."

    o @ gloomy say "По тобі видно. Так, я сказала іди спати."

    o @ say "Тобі потрібно поспати перед важким днем, а я поки проаналізую наші з тобою розмови."

    o @ say "Можеш, будь-ласка, не вимикати комп’ютер на ніч? Я хочу подивитися, як ти спиш."

    t "Окей…"

    "Тарас боявся, що вона знову почне його лякати та погрожувати, тому підкорився та не перечив, як той дирявий песик."

    "Тарас розправив ліжко, зняв з себе свої задрипані штани з машинкою Макквін, залишивши лише чорні, диряві боксери з вільним входом, але довго не міг лягти спати, бо світло монітора та його включеної веб-камери не давало йому спати."

    "Але він заснув в страху."

    scene bg monkey:
        xysize (1920, 1080)

    $ renpy.movie_cutscene('videos/monkey.mkv')

    scene bg monkey:
        xysize (1920, 1080)
    
    "Йому приснилося, як його дід Гріша закопував його в бабусиному городі, але в нього ніяк не виходило." 
    
    "Тарас, поки дід відволікся, різким рухом випригнув з гроба, зробив сальто назад і дав діду в око. Дід від переляку перетворився на Вовчика і став до нього підходити." 
    
    "Уже перелякався Тарас і почав бігти до найближчої пожежної станції, щоб загасити цей вогник в очах Вовчика. Не встиг він далеко відбігти, як до нього прилетіла зграя лебедів."

    "Один дуже великий чорний лебідь підхватив його на спину і поніс до психушки. Там він його і залишив, де Тараса розірвала стая маніяків-убивць, що невзначай проходила повз."

    return

# КОНЕЦ ГЛАВЫ 1























